Revit 2024 API
ParameterTypeId.StructuralFoundationLength Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralFoundationLength { get; }
Visual Basic
Public Shared ReadOnly Property StructuralFoundationLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralFoundationLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace